#include <bits/stdc++.h>

using namespace std;

typedef long long ll;

int main()
{
    ll a,b,c,d;
    ll ans=0;
    cin>>a>>b>>c>>d;
    //x>=a&&x<=b等价于x>a-1&&x<=b，这时可以使用区间的相关结论
    long long x[4];
    long long y[4];
    x[0]=b-a+1;
    //找出第一个区间中所有常数
    x[1]=b/2-(a-1)/2;
    //找出第一个区间中所有偶数
    x[2]=b/1009-(a-1)/1009;
    //找出第一个区间中所有1009的倍数
    x[3]=b/2018-(a-1)/2018;
    //找出第一个区间中所有2018的倍数
    x[2]-=x[3];//1009的倍数包含2018的倍数
    x[1]-=x[3];//偶数包含2018的倍数
    x[0]-=x[3]+x[2]+x[1];//常数包含偶数、2018和1009的倍数
    //处理区间一
    y[0]=d-c+1;
    y[1]=d/2-(c-1)/2;
    y[2]=d/1009-(c-1)/1009;
    y[3]=d/2018-(c-1)/2018;
    y[2]-=y[3];
    y[1]-=y[3];
    y[0]-=y[1]+y[2]+y[3];
    //处理区间二，内容同上
    ans+=x[1]*y[2];//偶数乘以1009
    ans+=x[1]*y[3];//偶数乘以2018
    ans+=x[2]*y[1];//1009乘以偶数
    ans+=x[2]*y[3];//1009乘以2018
    ans+=x[3]*y[1];//2018乘以偶数
    ans+=x[3]*y[2];//2018乘以1009
    ans+=x[3]*y[3];//2018乘以2018
    ans+=x[3]*y[0];//2018乘以常数
    ans+=x[0]*y[3];//常数乘以2018
    cout<<ans;
    return 0;
}
